OpenROAD 944855835623e651e7b9c7c50efcce1fb04b4fee 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/MULTI_32bit/runs/RUN_2022.04.04_17.18.50/tmp/merged_unpadded.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/MULTI_32bit/runs/RUN_2022.04.04_17.18.50/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/MULTI_32bit/runs/RUN_2022.04.04_17.18.50/tmp/placement/7-global.def
[INFO ODB-0128] Design: MULTI_32bit
[INFO ODB-0130]     Created 100 pins.
[INFO ODB-0131]     Created 5969 components and 37957 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 21716 connections.
[INFO ODB-0133]     Created 4743 nets and 16241 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/MULTI_32bit/runs/RUN_2022.04.04_17.18.50/tmp/placement/7-global.def
###############################################################################
# Created by write_sdc
# Mon Apr  4 17:19:09 2022
###############################################################################
current_design MULTI_32bit
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {F[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0177 [get_ports {F[31]}]
set_load -pin_load 0.0177 [get_ports {F[30]}]
set_load -pin_load 0.0177 [get_ports {F[29]}]
set_load -pin_load 0.0177 [get_ports {F[28]}]
set_load -pin_load 0.0177 [get_ports {F[27]}]
set_load -pin_load 0.0177 [get_ports {F[26]}]
set_load -pin_load 0.0177 [get_ports {F[25]}]
set_load -pin_load 0.0177 [get_ports {F[24]}]
set_load -pin_load 0.0177 [get_ports {F[23]}]
set_load -pin_load 0.0177 [get_ports {F[22]}]
set_load -pin_load 0.0177 [get_ports {F[21]}]
set_load -pin_load 0.0177 [get_ports {F[20]}]
set_load -pin_load 0.0177 [get_ports {F[19]}]
set_load -pin_load 0.0177 [get_ports {F[18]}]
set_load -pin_load 0.0177 [get_ports {F[17]}]
set_load -pin_load 0.0177 [get_ports {F[16]}]
set_load -pin_load 0.0177 [get_ports {F[15]}]
set_load -pin_load 0.0177 [get_ports {F[14]}]
set_load -pin_load 0.0177 [get_ports {F[13]}]
set_load -pin_load 0.0177 [get_ports {F[12]}]
set_load -pin_load 0.0177 [get_ports {F[11]}]
set_load -pin_load 0.0177 [get_ports {F[10]}]
set_load -pin_load 0.0177 [get_ports {F[9]}]
set_load -pin_load 0.0177 [get_ports {F[8]}]
set_load -pin_load 0.0177 [get_ports {F[7]}]
set_load -pin_load 0.0177 [get_ports {F[6]}]
set_load -pin_load 0.0177 [get_ports {F[5]}]
set_load -pin_load 0.0177 [get_ports {F[4]}]
set_load -pin_load 0.0177 [get_ports {F[3]}]
set_load -pin_load 0.0177 [get_ports {F[2]}]
set_load -pin_load 0.0177 [get_ports {F[1]}]
set_load -pin_load 0.0177 [get_ports {F[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {B[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 64 input buffers.
[INFO RSZ-0028] Inserted 32 output buffers.
[INFO RSZ-0058] Using max wire length 2319um.
[INFO RSZ-0034] Found 7 slew violations.
[INFO RSZ-0036] Found 7 capacitance violations.
[INFO RSZ-0038] Inserted 8 buffers in 7 nets.
[INFO RSZ-0039] Resized 4360 instances.
[INFO DPL-0034] Detailed placement failed on:
[INFO DPL-0035]  _7003_
[INFO DPL-0035]  _7003_
[INFO DPL-0035]  _7034_
[INFO DPL-0035]  _7089_
[INFO DPL-0035]  _7089_
[INFO DPL-0035]  _7108_
[INFO DPL-0035]  _7108_
[INFO DPL-0035]  _7108_
[INFO DPL-0035]  _7138_
[INFO DPL-0035]  _7138_
[INFO DPL-0035]  _7138_
[INFO DPL-0035]  _7151_
[INFO DPL-0035]  _7151_
[INFO DPL-0035]  _7151_
[INFO DPL-0035]  _7201_
[INFO DPL-0035]  _7201_
[INFO DPL-0035]  _7201_
[INFO DPL-0035]  _7251_
[INFO DPL-0035]  _7251_
[INFO DPL-0035]  _7251_
[INFO DPL-0035]  _7296_
[INFO DPL-0035]  _7296_
[INFO DPL-0035]  _7296_
[INFO DPL-0035]  _7329_
[INFO DPL-0035]  _7329_
[INFO DPL-0035]  _7350_
[INFO DPL-0035]  _7350_
[INFO DPL-0035]  _7350_
[INFO DPL-0035]  _7415_
[INFO DPL-0035]  _7415_
[INFO DPL-0035]  _7415_
[INFO DPL-0035]  _7485_
[INFO DPL-0035]  _7485_
[INFO DPL-0035]  _7508_
[INFO DPL-0035]  _7508_
[INFO DPL-0035]  _7508_
[INFO DPL-0035]  _7534_
[INFO DPL-0035]  _7534_
[INFO DPL-0035]  _7559_
[INFO DPL-0035]  _7559_
[INFO DPL-0035]  _7587_
[INFO DPL-0035]  _7613_
[INFO DPL-0035]  _7613_
[INFO DPL-0035]  _7613_
[INFO DPL-0035]  _7678_
[INFO DPL-0035]  _7678_
[INFO DPL-0035]  _7689_
[INFO DPL-0035]  _7689_
[INFO DPL-0035]  _7729_
[INFO DPL-0035]  _7747_
[INFO DPL-0035]  _7747_
[INFO DPL-0035]  _7766_
[INFO DPL-0035]  _7766_
[INFO DPL-0035]  _7766_
[INFO DPL-0035]  _7766_
[INFO DPL-0035]  _7771_
[INFO DPL-0035]  _7771_
[INFO DPL-0035]  _7771_
[INFO DPL-0035]  _7794_
[INFO DPL-0035]  _7794_
[INFO DPL-0035]  _7802_
[INFO DPL-0035]  _7818_
[INFO DPL-0035]  _7818_
[INFO DPL-0035]  _7882_
[INFO DPL-0035]  _7882_
[INFO DPL-0035]  _7882_
[INFO DPL-0035]  _7882_
[INFO DPL-0035]  _7882_
[INFO DPL-0035]  _7882_
[INFO DPL-0035]  _7945_
[INFO DPL-0035]  _7945_
[INFO DPL-0035]  _7988_
[INFO DPL-0035]  _7988_
[INFO DPL-0035]  _7988_
[INFO DPL-0035]  _8019_
[INFO DPL-0035]  _8019_
[INFO DPL-0035]  _8019_
[INFO DPL-0035]  _8051_
[INFO DPL-0035]  _8084_
[INFO DPL-0035]  _8084_
[INFO DPL-0035]  _8084_
[INFO DPL-0035]  _8135_
[INFO DPL-0035]  _8135_
[INFO DPL-0035]  _8135_
[INFO DPL-0035]  _8161_
[INFO DPL-0035]  _8161_
[INFO DPL-0035]  _8161_
[INFO DPL-0035]  _8191_
[INFO DPL-0035]  _8191_
[INFO DPL-0035]  _8191_
[INFO DPL-0035]  _8201_
[INFO DPL-0035]  _8255_
[INFO DPL-0035]  _8255_
[INFO DPL-0035]  _8255_
[INFO DPL-0035]  _8255_
[INFO DPL-0035]  _8284_
[INFO DPL-0035]  _8284_
[INFO DPL-0035]  _8284_
[INFO DPL-0035]  _8284_
[INFO DPL-0035]  _8284_
[INFO DPL-0035]  _8296_
[INFO DPL-0035]  _8296_
[INFO DPL-0035]  _8378_
[INFO DPL-0035]  _8378_
[INFO DPL-0035]  _8378_
[INFO DPL-0035]  _8378_
[INFO DPL-0035]  _8431_
[INFO DPL-0035]  _8460_
[INFO DPL-0035]  _8468_
[INFO DPL-0035]  _8468_
[INFO DPL-0035]  _8468_
[INFO DPL-0035]  _8485_
[INFO DPL-0035]  _8507_
[INFO DPL-0035]  _8507_
[INFO DPL-0035]  _8507_
[INFO DPL-0035]  _8507_
[INFO DPL-0035]  _8528_
[INFO DPL-0035]  _8528_
[INFO DPL-0035]  _8562_
[INFO DPL-0035]  _8562_
[INFO DPL-0035]  _8562_
[INFO DPL-0035]  _8586_
[INFO DPL-0035]  _8596_
[INFO DPL-0035]  _8596_
[INFO DPL-0035]  _8596_
[INFO DPL-0035]  _8659_
[INFO DPL-0035]  _8668_
[INFO DPL-0035]  _8668_
[INFO DPL-0035]  _8668_
[INFO DPL-0035]  _8726_
[INFO DPL-0035]  _8759_
[INFO DPL-0035]  _8759_
[INFO DPL-0035]  _8815_
[INFO DPL-0035]  _8815_
[INFO DPL-0035]  _8829_
[INFO DPL-0035]  _8864_
[INFO DPL-0035]  _8864_
[INFO DPL-0035]  _8864_
[INFO DPL-0035]  _8864_
[INFO DPL-0035]  _8899_
[INFO DPL-0035]  _8899_
[INFO DPL-0035]  _8933_
[INFO DPL-0035]  _8972_
[INFO DPL-0035]  _8972_
[INFO DPL-0035]  _8972_
[INFO DPL-0035]  _8995_
[INFO DPL-0035]  _8995_
[INFO DPL-0035]  _9010_
[INFO DPL-0035]  _9010_
[INFO DPL-0035]  _9010_
[INFO DPL-0035]  _9031_
[INFO DPL-0035]  _4971_
[INFO DPL-0035]  _4971_
[INFO DPL-0035]  _4992_
[INFO DPL-0035]  _4992_
[INFO DPL-0035]  _4992_
[INFO DPL-0035]  _5007_
[INFO DPL-0035]  _5007_
[INFO DPL-0035]  _5007_
[INFO DPL-0035]  _5007_
[INFO DPL-0035]  _5011_
[INFO DPL-0035]  _5011_
[INFO DPL-0035]  _5079_
[INFO DPL-0035]  _5079_
[INFO DPL-0035]  _5113_
[INFO DPL-0035]  _5114_
[INFO DPL-0035]  _5114_
[INFO DPL-0035]  _5122_
[INFO DPL-0035]  _5124_
[INFO DPL-0035]  _5124_
[INFO DPL-0035]  _5124_
[INFO DPL-0035]  _5128_
[INFO DPL-0035]  _5170_
[INFO DPL-0035]  _5170_
[INFO DPL-0035]  _5193_
[INFO DPL-0035]  _5193_
[INFO DPL-0035]  _5205_
[INFO DPL-0035]  _5205_
[INFO DPL-0035]  _5205_
[INFO DPL-0035]  _5205_
[INFO DPL-0035]  _5205_
[INFO DPL-0035]  _5216_
[INFO DPL-0035]  _5216_
[INFO DPL-0035]  _5226_
[INFO DPL-0035]  _5226_
[INFO DPL-0035]  _5226_
[INFO DPL-0035]  _5239_
[INFO DPL-0035]  _5239_
[INFO DPL-0035]  _5240_
[INFO DPL-0035]  _5240_
[INFO DPL-0035]  _5240_
[INFO DPL-0035]  _5240_
[INFO DPL-0035]  _5292_
[INFO DPL-0035]  _5292_
[INFO DPL-0035]  _5292_
[INFO DPL-0035]  _5292_
[INFO DPL-0035]  _5292_
[INFO DPL-0035]  _5353_
[INFO DPL-0035]  _5353_
[INFO DPL-0035]  _5353_
[INFO DPL-0035]  _5372_
[INFO DPL-0035]  _5372_
[INFO DPL-0035]  _5407_
[INFO DPL-0035]  _5407_
[INFO DPL-0035]  _5413_
[INFO DPL-0035]  _5413_
[INFO DPL-0035]  _5413_
[INFO DPL-0035]  _5434_
[INFO DPL-0035]  _5434_
[INFO DPL-0035]  _5437_
[INFO DPL-0035]  _5460_
[INFO DPL-0035]  _5460_
[INFO DPL-0035]  _5460_
[INFO DPL-0035]  _5486_
[INFO DPL-0035]  _5486_
[INFO DPL-0035]  _5486_
[INFO DPL-0035]  _5486_
[INFO DPL-0035]  _5504_
[INFO DPL-0035]  _5509_
[INFO DPL-0035]  _5510_
[INFO DPL-0035]  _5510_
[INFO DPL-0035]  _5510_
[INFO DPL-0035]  _5510_
[INFO DPL-0035]  _5558_
[INFO DPL-0035]  _5558_
[INFO DPL-0035]  _5607_
[INFO DPL-0035]  _5607_
[INFO DPL-0035]  _5611_
[INFO DPL-0035]  _5611_
[INFO DPL-0035]  _5648_
[INFO DPL-0035]  _5648_
[INFO DPL-0035]  _5693_
[INFO DPL-0035]  _5693_
[INFO DPL-0035]  _5693_
[INFO DPL-0035]  _5714_
[INFO DPL-0035]  _5718_
[INFO DPL-0035]  _5764_
[INFO DPL-0035]  _5764_
[INFO DPL-0035]  _5764_
[INFO DPL-0035]  _5781_
[INFO DPL-0035]  _5785_
[INFO DPL-0035]  _5785_
[INFO DPL-0035]  _5785_
[INFO DPL-0035]  _5814_
[INFO DPL-0035]  _5814_
[INFO DPL-0035]  _5814_
[INFO DPL-0035]  _5819_
[INFO DPL-0035]  _5819_
[INFO DPL-0035]  _5819_
[INFO DPL-0035]  _5844_
[INFO DPL-0035]  _5844_
[INFO DPL-0035]  _5844_
[INFO DPL-0035]  _5850_
[INFO DPL-0035]  _5850_
[INFO DPL-0035]  _5884_
[INFO DPL-0035]  _5884_
[INFO DPL-0035]  _5897_
[INFO DPL-0035]  _5910_
[INFO DPL-0035]  _5910_
[INFO DPL-0035]  _5910_
[INFO DPL-0035]  _5916_
[INFO DPL-0035]  _5916_
[INFO DPL-0035]  _5916_
[INFO DPL-0035]  _5951_
[INFO DPL-0035]  _5951_
[INFO DPL-0035]  _5951_
[INFO DPL-0035]  _5951_
[INFO DPL-0035]  _5984_
[INFO DPL-0035]  _5984_
[INFO DPL-0035]  _5984_
[INFO DPL-0035]  _5984_
[INFO DPL-0035]  _6034_
[INFO DPL-0035]  _6034_
[INFO DPL-0035]  _6034_
[INFO DPL-0035]  _6069_
[INFO DPL-0035]  _6069_
[INFO DPL-0035]  _6085_
[INFO DPL-0035]  _6085_
[INFO DPL-0035]  _6085_
[INFO DPL-0035]  _6085_
[INFO DPL-0035]  _6109_
[INFO DPL-0035]  _6109_
[INFO DPL-0035]  _6116_
[INFO DPL-0035]  _6116_
[INFO DPL-0035]  _6123_
[INFO DPL-0035]  _6123_
[INFO DPL-0035]  _6123_
[INFO DPL-0035]  _6140_
[INFO DPL-0035]  _6140_
[INFO DPL-0035]  _6140_
[INFO DPL-0035]  _6187_
[INFO DPL-0035]  _6202_
[INFO DPL-0035]  _6206_
[INFO DPL-0035]  _6206_
[INFO DPL-0035]  _6206_
[INFO DPL-0035]  _6208_
[INFO DPL-0035]  _6208_
[INFO DPL-0035]  _6216_
[INFO DPL-0035]  _6216_
[INFO DPL-0035]  _6294_
[INFO DPL-0035]  _6307_
[INFO DPL-0035]  _6316_
[INFO DPL-0035]  _6316_
[INFO DPL-0035]  _6353_
[INFO DPL-0035]  _6369_
[INFO DPL-0035]  _6369_
[INFO DPL-0035]  _6409_
[INFO DPL-0035]  _6433_
[INFO DPL-0035]  _6433_
[INFO DPL-0035]  _6518_
[INFO DPL-0035]  _6518_
[INFO DPL-0035]  _6518_
[INFO DPL-0035]  _6601_
[INFO DPL-0035]  _6601_
[INFO DPL-0035]  _6650_
[INFO DPL-0035]  _6650_
[INFO DPL-0035]  _6650_
[INFO DPL-0035]  _6695_
[INFO DPL-0035]  _6695_
[INFO DPL-0035]  _6744_
[INFO DPL-0035]  _6796_
[INFO DPL-0035]  _6796_
[INFO DPL-0035]  _6843_
[INFO DPL-0035]  _6843_
[INFO DPL-0035]  _6843_
[INFO DPL-0035]  _6843_
[INFO DPL-0035]  _6857_
[INFO DPL-0035]  _6904_
[INFO DPL-0035]  _6904_
[INFO DPL-0035]  _6934_
[INFO DPL-0035]  _6934_
[INFO DPL-0035]  _6936_
[INFO DPL-0035]  _6936_
[INFO DPL-0035]  _6936_
[INFO DPL-0035]  _6940_
[INFO DPL-0035]  _6985_
[INFO DPL-0035]  _6985_
[INFO DPL-0035]  _7067_
[INFO DPL-0035]  _7100_
[INFO DPL-0035]  _7162_
[INFO DPL-0035]  _7162_
[INFO DPL-0035]  _7210_
[INFO DPL-0035]  _7210_
[INFO DPL-0035]  _7210_
[INFO DPL-0035]  _7256_
[INFO DPL-0035]  _7256_
[INFO DPL-0035]  _7256_
[INFO DPL-0035]  _7364_
[INFO DPL-0035]  _7364_
[INFO DPL-0035]  _7442_
[INFO DPL-0035]  _7442_
[INFO DPL-0035]  _7442_
[INFO DPL-0035]  _7442_
[INFO DPL-0035]  _7489_
[INFO DPL-0035]  _7489_
[INFO DPL-0035]  _7489_
[INFO DPL-0035]  _7489_
[INFO DPL-0035]  _7489_
[INFO DPL-0035]  _7593_
[INFO DPL-0035]  _7593_
[INFO DPL-0035]  _7624_
[INFO DPL-0035]  _7624_
[INFO DPL-0035]  _7685_
[INFO DPL-0035]  _7685_
[INFO DPL-0035]  _7742_
[INFO DPL-0035]  _7810_
[INFO DPL-0035]  _7810_
[INFO DPL-0035]  _7836_
[INFO DPL-0035]  _7836_
[INFO DPL-0035]  _7871_
[INFO DPL-0035]  _7918_
[INFO DPL-0035]  _7918_
[INFO DPL-0035]  _8008_
[INFO DPL-0035]  _8008_
[INFO DPL-0035]  _8008_
[INFO DPL-0035]  _8029_
[INFO DPL-0035]  _8029_
[INFO DPL-0035]  _8114_
[INFO DPL-0035]  _8114_
[INFO DPL-0035]  _8233_
[INFO DPL-0035]  _8233_
[INFO DPL-0035]  _8233_
[INFO DPL-0035]  _8233_
[INFO DPL-0035]  _8260_
[INFO DPL-0035]  _8260_
[INFO DPL-0035]  _8285_
[INFO DPL-0035]  _8285_
[INFO DPL-0035]  _8285_
[INFO DPL-0035]  _8314_
[INFO DPL-0035]  _8314_
[INFO DPL-0035]  _8314_
[INFO DPL-0035]  _8405_
[INFO DPL-0035]  _8405_
[INFO DPL-0035]  _8405_
[INFO DPL-0035]  _8444_
[INFO DPL-0035]  _8464_
[INFO DPL-0035]  _8464_
[INFO DPL-0035]  _8464_
[INFO DPL-0035]  _8464_
[INFO DPL-0035]  _8502_
[INFO DPL-0035]  _8758_
[INFO DPL-0035]  _8758_
[INFO DPL-0035]  _8758_
[INFO DPL-0035]  _8758_
[INFO DPL-0035]  _8792_
[INFO DPL-0035]  _8792_
[INFO DPL-0035]  _8792_
[INFO DPL-0035]  _8886_
[INFO DPL-0035]  _8886_
[INFO DPL-0035]  _8886_
[INFO DPL-0035]  _9007_
[INFO DPL-0035]  _9007_
[INFO DPL-0035]  repeater97
[INFO DPL-0035]  repeater101
[INFO DPL-0035]  repeater101
[INFO DPL-0035]  repeater101
[INFO DPL-0035]  _5562_
[INFO DPL-0035]  _5562_
[INFO DPL-0035]  _5562_
[INFO DPL-0035]  _5579_
[INFO DPL-0035]  _5579_
[INFO DPL-0035]  _5582_
[INFO DPL-0035]  _5582_
[INFO DPL-0035]  _5582_
[INFO DPL-0035]  _5612_
[INFO DPL-0035]  _5612_
[INFO DPL-0035]  _5612_
[INFO DPL-0035]  _5612_
[INFO DPL-0035]  _5636_
[INFO DPL-0035]  _5636_
[INFO DPL-0035]  _5650_
[INFO DPL-0035]  _5650_
[INFO DPL-0035]  _5650_
[INFO DPL-0035]  _5655_
[INFO DPL-0035]  _5655_
[INFO DPL-0035]  _5670_
[INFO DPL-0035]  _5670_
[INFO DPL-0035]  _5670_
[INFO DPL-0035]  _5674_
[INFO DPL-0035]  _5674_
[INFO DPL-0035]  _5679_
[INFO DPL-0035]  _5698_
[INFO DPL-0035]  _5698_
[INFO DPL-0035]  _5698_
[INFO DPL-0035]  _5698_
[INFO DPL-0035]  _5709_
[INFO DPL-0035]  _5709_
[INFO DPL-0035]  _5712_
[INFO DPL-0035]  _5712_
[INFO DPL-0035]  _5721_
[INFO DPL-0035]  _5721_
[INFO DPL-0035]  _5721_
[INFO DPL-0035]  _5744_
[INFO DPL-0035]  _5763_
[INFO DPL-0035]  _5763_
[INFO DPL-0035]  _5789_
[INFO DPL-0035]  _5820_
[INFO DPL-0035]  _5820_
[INFO DPL-0035]  _5820_
[INFO DPL-0035]  _5820_
[INFO DPL-0035]  _5820_
[INFO DPL-0035]  _5820_
[INFO DPL-0035]  _5830_
[INFO DPL-0035]  _5830_
[INFO DPL-0035]  _5839_
[INFO DPL-0035]  _5839_
[INFO DPL-0035]  _5887_
[INFO DPL-0035]  _5887_
[INFO DPL-0035]  _5887_
[INFO DPL-0035]  _5887_
[INFO DPL-0035]  _5887_
[INFO DPL-0035]  _5937_
[INFO DPL-0035]  _5937_
[INFO DPL-0035]  _5945_
[INFO DPL-0035]  _5945_
[INFO DPL-0035]  _5945_
[INFO DPL-0035]  _5969_
[INFO DPL-0035]  _5969_
[INFO DPL-0035]  _5969_
[INFO DPL-0035]  _6019_
[INFO DPL-0035]  _6019_
[INFO DPL-0035]  _6019_
[INFO DPL-0035]  _6025_
[INFO DPL-0035]  _6025_
[INFO DPL-0035]  _6078_
[INFO DPL-0035]  _6135_
[INFO DPL-0035]  _6136_
[INFO DPL-0035]  _6160_
[INFO DPL-0035]  _6160_
[INFO DPL-0035]  _6164_
[INFO DPL-0035]  _6164_
[INFO DPL-0035]  _6164_
[INFO DPL-0035]  _6183_
[INFO DPL-0035]  _6183_
[INFO DPL-0035]  _6230_
[INFO DPL-0035]  _6230_
[INFO DPL-0035]  _6230_
[INFO DPL-0035]  _6242_
[INFO DPL-0035]  _6242_
[INFO DPL-0035]  _6268_
[INFO DPL-0035]  _6289_
[INFO DPL-0035]  _6289_
[INFO DPL-0035]  _6289_
[INFO DPL-0035]  _6289_
[INFO DPL-0035]  _6310_
[INFO DPL-0035]  _6310_
[INFO DPL-0035]  _6310_
[INFO DPL-0035]  _6310_
[INFO DPL-0035]  _6344_
[INFO DPL-0035]  _6344_
[INFO DPL-0035]  _6344_
[INFO DPL-0035]  _6344_
[INFO DPL-0035]  _6344_
[INFO DPL-0035]  _6374_
[INFO DPL-0035]  _6374_
[INFO DPL-0035]  _6374_
[INFO DPL-0035]  _6394_
[INFO DPL-0035]  _6394_
[INFO DPL-0035]  _6394_
[INFO DPL-0035]  _6429_
[INFO DPL-0035]  _6429_
[INFO DPL-0035]  _6451_
[INFO DPL-0035]  _6451_
[INFO DPL-0035]  _6454_
[INFO DPL-0035]  _6454_
[INFO DPL-0035]  _6469_
[INFO DPL-0035]  _6489_
[INFO DPL-0035]  _6489_
[INFO DPL-0035]  _6489_
[INFO DPL-0035]  _6489_
[INFO DPL-0035]  _6500_
[INFO DPL-0035]  _6500_
[INFO DPL-0035]  _6531_
[INFO DPL-0035]  _6531_
[INFO DPL-0035]  _6536_
[INFO DPL-0035]  _6536_
[INFO DPL-0035]  _6536_
[INFO DPL-0035]  _6536_
[INFO DPL-0035]  _6554_
[INFO DPL-0035]  _6554_
[INFO DPL-0035]  _6554_
[INFO DPL-0035]  _6554_
[INFO DPL-0035]  _6578_
[INFO DPL-0035]  _6578_
[INFO DPL-0035]  _6578_
[INFO DPL-0035]  _6590_
[INFO DPL-0035]  _6590_
[INFO DPL-0035]  _6637_
[INFO DPL-0035]  _6637_
[INFO DPL-0035]  _6637_
[INFO DPL-0035]  _6658_
[INFO DPL-0035]  _6658_
[INFO DPL-0035]  _6678_
[INFO DPL-0035]  _6678_
[INFO DPL-0035]  _6678_
[INFO DPL-0035]  _6724_
[INFO DPL-0035]  _6724_
[INFO DPL-0035]  _6746_
[INFO DPL-0035]  _6746_
[INFO DPL-0035]  _6768_
[INFO DPL-0035]  _6782_
[INFO DPL-0035]  _6782_
[INFO DPL-0035]  _6793_
[INFO DPL-0035]  _6793_
[INFO DPL-0035]  _6793_
[INFO DPL-0035]  _6793_
[INFO DPL-0035]  _6827_
[INFO DPL-0035]  _6827_
[INFO DPL-0035]  _6861_
[INFO DPL-0035]  _6861_
[INFO DPL-0035]  _6861_
[INFO DPL-0035]  _6877_
[INFO DPL-0035]  _6877_
[INFO DPL-0035]  _6889_
[INFO DPL-0035]  _6889_
[INFO DPL-0035]  _6896_
[INFO DPL-0035]  _6896_
[INFO DPL-0035]  _6896_
[INFO DPL-0035]  _6949_
[INFO DPL-0035]  _6949_
[INFO DPL-0035]  _6963_
[INFO DPL-0035]  _6963_
[INFO DPL-0035]  _6963_
[INFO DPL-0035]  _6968_
[INFO DPL-0035]  _6968_
[INFO DPL-0035]  _6988_
[INFO DPL-0035]  _6988_
[INFO DPL-0035]  _6988_
[INFO DPL-0035]  _6988_
[INFO DPL-0035]  _6988_
[INFO DPL-0035]  _7005_
[INFO DPL-0035]  _7005_
[INFO DPL-0035]  _7012_
[INFO DPL-0035]  _7012_
[INFO DPL-0035]  _7012_
[INFO DPL-0035]  _7049_
[INFO DPL-0035]  _7055_
[INFO DPL-0035]  _7055_
[INFO DPL-0035]  _7065_
[INFO DPL-0035]  _7066_
[INFO DPL-0035]  _7066_
[INFO DPL-0035]  _7076_
[INFO DPL-0035]  _7076_
[INFO DPL-0035]  _7076_
[INFO DPL-0035]  _7076_
[INFO DPL-0035]  _7076_
[INFO DPL-0035]  _7094_
[INFO DPL-0035]  _7094_
[INFO DPL-0035]  _7118_
[INFO DPL-0035]  _7118_
[INFO DPL-0035]  _7125_
[INFO DPL-0035]  _7145_
[INFO DPL-0035]  _7145_
[INFO DPL-0035]  _7145_
[INFO DPL-0035]  _7145_
[INFO DPL-0035]  _7175_
[INFO DPL-0035]  _7175_
[INFO DPL-0035]  _7197_
[INFO DPL-0035]  _7197_
[INFO DPL-0035]  _7200_
[INFO DPL-0035]  _7200_
[INFO DPL-0035]  _7228_
[INFO DPL-0035]  _7228_
[INFO DPL-0035]  _7263_
[INFO DPL-0035]  _7263_
[INFO DPL-0035]  _7263_
[INFO DPL-0035]  _7291_
[INFO DPL-0035]  _7300_
[INFO DPL-0035]  _7300_
[INFO DPL-0035]  _7300_
[INFO DPL-0035]  _7300_
[INFO DPL-0035]  _7300_
[INFO DPL-0035]  _7322_
[INFO DPL-0035]  _7322_
[INFO DPL-0035]  _7332_
[INFO DPL-0035]  _7332_
[INFO DPL-0035]  _7332_
[INFO DPL-0035]  _7332_
[INFO DPL-0035]  _7342_
[INFO DPL-0035]  _7342_
[INFO DPL-0035]  _7342_
[INFO DPL-0035]  _7360_
[INFO DPL-0035]  _7360_
[INFO DPL-0035]  _7360_
[INFO DPL-0035]  _7360_
[INFO DPL-0035]  _7380_
[INFO DPL-0035]  _7380_
[INFO DPL-0035]  _7390_
[INFO DPL-0035]  _7390_
[INFO DPL-0035]  _7425_
[INFO DPL-0035]  _7425_
[INFO DPL-0035]  _7425_
[INFO DPL-0035]  _7441_
[INFO DPL-0035]  _7441_
[INFO DPL-0035]  _7441_
[INFO DPL-0035]  _7480_
[INFO DPL-0035]  _7480_
[INFO DPL-0035]  _7480_
[INFO DPL-0035]  _7505_
[INFO DPL-0035]  _7505_
[INFO DPL-0035]  _7522_
[INFO DPL-0035]  _7522_
[INFO DPL-0035]  _7522_
[INFO DPL-0035]  _7541_
[INFO DPL-0035]  _7541_
[INFO DPL-0035]  _7541_
[INFO DPL-0035]  _7560_
[INFO DPL-0035]  _7574_
[INFO DPL-0035]  _7584_
[INFO DPL-0035]  _7622_
[INFO DPL-0035]  _7622_
[INFO DPL-0035]  _7622_
[INFO DPL-0035]  _7622_
[INFO DPL-0035]  _7622_
[INFO DPL-0035]  _7669_
[INFO DPL-0035]  _7669_
[INFO DPL-0035]  _7669_
[INFO DPL-0035]  _7680_
[INFO DPL-0035]  _7680_
[INFO DPL-0035]  _7680_
[INFO DPL-0035]  _7719_
[INFO DPL-0035]  _7719_
[INFO DPL-0035]  _7762_
[INFO DPL-0035]  _7762_
[INFO DPL-0035]  _7762_
[INFO DPL-0035]  _7770_
[INFO DPL-0035]  _7782_
[INFO DPL-0035]  _7782_
[INFO DPL-0035]  _7782_
[INFO DPL-0035]  _7782_
[INFO DPL-0035]  _7793_
[INFO DPL-0035]  _7798_
[INFO DPL-0035]  _7798_
[INFO DPL-0035]  _7798_
[INFO DPL-0035]  _7815_
[INFO DPL-0035]  _7821_
[INFO DPL-0035]  _7821_
[INFO DPL-0035]  _7821_
[INFO DPL-0035]  _7822_
[INFO DPL-0035]  _7822_
[INFO DPL-0035]  _7837_
[INFO DPL-0035]  _7837_
[INFO DPL-0035]  _7863_
[INFO DPL-0035]  _7863_
[INFO DPL-0035]  _7887_
[INFO DPL-0035]  _7887_
[INFO DPL-0035]  _7887_
[INFO DPL-0035]  _7887_
[INFO DPL-0035]  _7910_
[INFO DPL-0035]  _7924_
[INFO DPL-0035]  _7924_
[INFO DPL-0035]  _7932_
[INFO DPL-0035]  _7932_
[INFO DPL-0035]  _7934_
[INFO DPL-0035]  _7934_
[INFO DPL-0035]  _7934_
[INFO DPL-0035]  _7964_
[INFO DPL-0035]  _7964_
[INFO DPL-0035]  _7964_
[INFO DPL-0035]  _7964_
[INFO DPL-0035]  _8010_
[INFO DPL-0035]  _8010_
[INFO DPL-0035]  _8021_
[INFO DPL-0035]  _8021_
[INFO DPL-0035]  _8037_
[INFO DPL-0035]  _8037_
[INFO DPL-0035]  _8045_
[INFO DPL-0035]  _8045_
[INFO DPL-0035]  _8045_
[INFO DPL-0035]  _8045_
[INFO DPL-0035]  _8057_
[INFO DPL-0035]  _8057_
[INFO DPL-0035]  _8057_
[INFO DPL-0035]  _8104_
[INFO DPL-0035]  _8104_
[INFO DPL-0035]  _8129_
[INFO DPL-0035]  _8129_
[INFO DPL-0035]  _8129_
[INFO DPL-0035]  _8129_
[INFO DPL-0035]  _8145_
[INFO DPL-0035]  _8145_
[INFO DPL-0035]  _8166_
[INFO DPL-0035]  _8166_
[INFO DPL-0035]  _8166_
[INFO DPL-0035]  _8176_
[INFO DPL-0035]  _8184_
[INFO DPL-0035]  _8184_
[INFO DPL-0035]  _8193_
[INFO DPL-0035]  _8213_
[INFO DPL-0035]  _8214_
[INFO DPL-0035]  _8214_
[INFO DPL-0035]  _8214_
[INFO DPL-0035]  _8250_
[INFO DPL-0035]  _8250_
[INFO DPL-0035]  _8250_
[INFO DPL-0035]  _8294_
[INFO DPL-0035]  _8294_
[INFO DPL-0035]  _8326_
[INFO DPL-0035]  _8326_
[INFO DPL-0035]  _8359_
[INFO DPL-0035]  _8367_
[INFO DPL-0035]  _8367_
[INFO DPL-0035]  _8377_
[INFO DPL-0035]  _8401_
[INFO DPL-0035]  _8401_
[INFO DPL-0035]  _8401_
[INFO DPL-0035]  _8401_
[INFO DPL-0035]  _8438_
[INFO DPL-0035]  _8438_
[INFO DPL-0035]  _8438_
[INFO DPL-0035]  _8449_
[INFO DPL-0035]  _8449_
[INFO DPL-0035]  _8449_
[INFO DPL-0035]  _8474_
[INFO DPL-0035]  _8474_
[INFO DPL-0035]  _8483_
[INFO DPL-0035]  _8483_
[INFO DPL-0035]  _8486_
[INFO DPL-0035]  _8486_
[INFO DPL-0035]  _8486_
[INFO DPL-0035]  _8486_
[INFO DPL-0035]  _8515_
[INFO DPL-0035]  _8515_
[INFO DPL-0035]  _8515_
[INFO DPL-0035]  _8515_
[INFO DPL-0035]  _8526_
[INFO DPL-0035]  _8535_
[INFO DPL-0035]  _8535_
[INFO DPL-0035]  _8560_
[INFO DPL-0035]  _8560_
[INFO DPL-0035]  _8568_
[INFO DPL-0035]  _8568_
[INFO DPL-0035]  _8580_
[INFO DPL-0035]  _8580_
[INFO DPL-0035]  _8588_
[INFO DPL-0035]  _8597_
[INFO DPL-0035]  _8597_
[INFO DPL-0035]  _8601_
[INFO DPL-0035]  _8604_
[INFO DPL-0035]  _8604_
[INFO DPL-0035]  _8628_
[INFO DPL-0035]  _8628_
[INFO DPL-0035]  _8636_
[INFO DPL-0035]  _8636_
[INFO DPL-0035]  _8636_
[INFO DPL-0035]  _8650_
[INFO DPL-0035]  _8650_
[INFO DPL-0035]  _8650_
[INFO DPL-0035]  _8658_
[INFO DPL-0035]  _8658_
[INFO DPL-0035]  _8658_
[INFO DPL-0035]  _8660_
[INFO DPL-0035]  _8660_
[INFO DPL-0035]  _8666_
[INFO DPL-0035]  _8693_
[INFO DPL-0035]  _8694_
[INFO DPL-0035]  _8694_
[INFO DPL-0035]  _8694_
[INFO DPL-0035]  _8717_
[INFO DPL-0035]  _8717_
[INFO DPL-0035]  _8717_
[INFO DPL-0035]  _8750_
[INFO DPL-0035]  _8752_
[INFO DPL-0035]  _8752_
[INFO DPL-0035]  _8774_
[INFO DPL-0035]  _8774_
[INFO DPL-0035]  _8774_
[INFO DPL-0035]  _8774_
[INFO DPL-0035]  _8782_
[INFO DPL-0035]  _8817_
[INFO DPL-0035]  _8817_
[INFO DPL-0035]  _8835_
[INFO DPL-0035]  _8844_
[INFO DPL-0035]  _8846_
[INFO DPL-0035]  _8846_
[INFO DPL-0035]  _8892_
[INFO DPL-0035]  _8892_
[INFO DPL-0035]  _8900_
[INFO DPL-0035]  _8900_
[INFO DPL-0035]  _8900_
[INFO DPL-0035]  _8934_
[INFO DPL-0035]  _8934_
[INFO DPL-0035]  _8937_
[INFO DPL-0035]  _8963_
[INFO DPL-0035]  _8963_
[INFO DPL-0035]  _8999_
[INFO DPL-0035]  _8999_
[INFO DPL-0035]  _8999_
[INFO DPL-0035]  _9000_
[INFO DPL-0035]  _9008_
[INFO DPL-0035]  _9009_
[INFO DPL-0035]  input18
[INFO DPL-0035]  input18
[INFO DPL-0035]  input50
[INFO DPL-0035]  input50
[INFO DPL-0035]  _7880_
[INFO DPL-0035]  _7880_
[INFO DPL-0035]  _7880_
[INFO DPL-0035]  _7880_
[INFO DPL-0035]  _7929_
[INFO DPL-0035]  _8076_
[INFO DPL-0035]  _8076_
[INFO DPL-0035]  _8076_
[INFO DPL-0035]  _8076_
[INFO DPL-0035]  _8157_
[INFO DPL-0035]  _8157_
[INFO DPL-0035]  _8157_
[INFO DPL-0035]  _8249_
[INFO DPL-0035]  _8298_
[INFO DPL-0035]  _8298_
[INFO DPL-0035]  _8298_
[INFO DPL-0035]  _8372_
[INFO DPL-0035]  _8372_
[INFO DPL-0035]  _8372_
[INFO DPL-0035]  _8384_
[INFO DPL-0035]  _8384_
[INFO DPL-0035]  _8421_
[INFO DPL-0035]  _8536_
[INFO DPL-0035]  _8536_
[INFO DPL-0035]  _8589_
[INFO DPL-0035]  _8606_
[INFO DPL-0035]  _8653_
[INFO DPL-0035]  _8653_
[INFO DPL-0035]  _8700_
[INFO DPL-0035]  _8749_
[INFO DPL-0035]  _8749_
[INFO DPL-0035]  _8749_
[INFO DPL-0035]  _8888_
[INFO DPL-0035]  _8888_
[INFO DPL-0035]  _8944_
[INFO DPL-0035]  _8944_
[INFO DPL-0035]  _9022_
[INFO DPL-0035]  _9022_
[INFO DPL-0035]  _9022_
[INFO DPL-0035]  _5179_
[INFO DPL-0035]  _5179_
[INFO DPL-0035]  _5179_
[INFO DPL-0035]  _5233_
[INFO DPL-0035]  _5251_
[INFO DPL-0035]  _5251_
[INFO DPL-0035]  _5266_
[INFO DPL-0035]  _5266_
[INFO DPL-0035]  _5266_
[INFO DPL-0035]  _5419_
[INFO DPL-0035]  _5419_
[INFO DPL-0035]  _5475_
[INFO DPL-0035]  _5475_
[INFO DPL-0035]  _5560_
[INFO DPL-0035]  _5560_
[INFO DPL-0035]  _5589_
[INFO DPL-0035]  _5589_
[INFO DPL-0035]  _5604_
[INFO DPL-0035]  _5604_
[INFO DPL-0035]  _5663_
[INFO DPL-0035]  _5663_
[INFO DPL-0035]  _5703_
[INFO DPL-0035]  _5703_
[INFO DPL-0035]  _5735_
[INFO DPL-0035]  _5742_
[INFO DPL-0035]  _5742_
[INFO DPL-0035]  _5742_
[INFO DPL-0035]  _5742_
[INFO DPL-0035]  _5742_
[INFO DPL-0035]  _5751_
[INFO DPL-0035]  _5751_
[INFO DPL-0035]  _5762_
[INFO DPL-0035]  _5762_
[INFO DPL-0035]  _5810_
[INFO DPL-0035]  _5810_
[INFO DPL-0035]  _5810_
[INFO DPL-0035]  _5858_
[INFO DPL-0035]  _5858_
[INFO DPL-0035]  _5858_
[INFO DPL-0035]  _5872_
[INFO DPL-0035]  _5872_
[INFO DPL-0035]  _5872_
[INFO DPL-0035]  _5872_
[INFO DPL-0035]  _5872_
[INFO DPL-0035]  _5962_
[INFO DPL-0035]  _5962_
[INFO DPL-0035]  _6030_
[INFO DPL-0035]  _6030_
[INFO DPL-0035]  _6105_
[INFO DPL-0035]  _6175_
[INFO DPL-0035]  _6175_
[INFO DPL-0035]  _6175_
[INFO DPL-0035]  _6249_
[INFO DPL-0035]  _6249_
[INFO DPL-0035]  _6249_
[INFO DPL-0035]  _6371_
[INFO DPL-0035]  _6449_
[INFO DPL-0035]  _6449_
[INFO DPL-0035]  _6449_
[INFO DPL-0035]  _6586_
[INFO DPL-0035]  _6586_
[INFO DPL-0035]  _6586_
[INFO DPL-0035]  _6586_
[INFO DPL-0035]  _6714_
[INFO DPL-0035]  _6714_
[INFO DPL-0035]  _6714_
[INFO DPL-0035]  _6742_
[INFO DPL-0035]  _6805_
[INFO DPL-0035]  _6805_
[INFO DPL-0035]  _6805_
[INFO DPL-0035]  _6838_
[INFO DPL-0035]  _6838_
[INFO DPL-0035]  _6855_
[INFO DPL-0035]  _6855_
[INFO DPL-0035]  _6859_
[INFO DPL-0035]  _6859_
[INFO DPL-0035]  _6887_
[INFO DPL-0035]  _6887_
[INFO DPL-0035]  _6929_
[INFO DPL-0035]  _6955_
[INFO DPL-0035]  _6955_
[INFO DPL-0035]  _6995_
[INFO DPL-0035]  _6995_
[INFO DPL-0035]  _6995_
[INFO DPL-0035]  _7026_
[INFO DPL-0035]  _7026_
[INFO DPL-0035]  _7042_
[INFO DPL-0035]  _7042_
[INFO DPL-0035]  _7072_
[INFO DPL-0035]  _7072_
[INFO DPL-0035]  _7133_
[INFO DPL-0035]  _7133_
[INFO DPL-0035]  _7184_
[INFO DPL-0035]  _7184_
[INFO DPL-0035]  _7206_
[INFO DPL-0035]  _7224_
[INFO DPL-0035]  _7224_
[INFO DPL-0035]  _7268_
[INFO DPL-0035]  _7268_
[INFO DPL-0035]  _7268_
[INFO DPL-0035]  _7268_
[INFO DPL-0035]  _7277_
[INFO DPL-0035]  _7277_
[INFO DPL-0035]  _7289_
[INFO DPL-0035]  _7289_
[INFO DPL-0035]  _7289_
[INFO DPL-0035] message limit reached, this message will no longer print
[ERROR DPL-0036] Detailed placement failed.
Error: resizer.tcl, 79 DPL-0036
